vlm/base/InformationRegisters/ОперацииПроверкиКМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОперацииПроверкиКМ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗапросКодаМаркировки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатПроверкиКМНаККТ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатПроверкиКМНаСервере</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагиПроверкиОИСМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПокупкаПодтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервераЗапросаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстЗапросаРазрешения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтветаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатЗапросаРазрешения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗапросаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяЗапросаРазрешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаРазрешена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаЗапрета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗапросаЕГАИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписьЧекаЕГАИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВходящееСообщениеЕГАИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СообщениеЕГАИСвБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходящееСообщениеЕГАИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СообщениеЕГАИСвБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеПереданоЕГАИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибкиЕГАИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМаркировкиПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСессии</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторФискальнойОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГодМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/InformationRegisters/ОперацииПроверкиКМ/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВиртуальныеПоля = Новый Массив();
	ВиртуальныеПоля.Добавить("РезультатПроверкиОИСМ");
	ВиртуальныеПоля.Добавить("ТипКода");
	Список.УстановитьОграниченияИспользованияВГруппировке(ВиртуальныеПоля);
	Список.УстановитьОграниченияИспользованияВОтборе(ВиртуальныеПоля);
	Список.УстановитьОграниченияИспользованияВПорядке(ВиртуальныеПоля);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИдентификаторФискальнойОперации");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементОтбора.ПравоеЗначение = "";
	ЭлементОтбора.Использование = Ложь;
	
	ТипыОборудований = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ТипыОборудований.СканерШтрихкода = Истина;
	МенеджерОборудования.ПриСозданииНаСервере(ЭтотОбъект, ТипыОборудований);
	
	ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ТипыОборудования.СканерШтрихкода = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование"  И ВводДоступен() Тогда
		Если ТипЗнч(Параметр) = Тип("Массив") И Параметр.Количество()>0 Тогда
			Если ИмяСобытия = "ScanDataBase64" Тогда
				КодМаркировкиBase64 = Параметр[0];
			ИначеЕсли ИмяСобытия = "ScanData" Тогда
				КодМаркировкиBase64 = ОбщегоНазначенияБПОКлиентСервер.ШтрихкодВBase64(Параметр[0]);
			Иначе
				Возврат;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Параметр) = Тип("Структура") Тогда
			Если ИмяСобытия = "ScanDataBase64" Тогда
				КодМаркировкиBase64 = Параметр.Штрихкод;
			ИначеЕсли ИмяСобытия = "ScanData" Тогда
				КодМаркировкиBase64 = ОбщегоНазначенияБПОКлиентСервер.ШтрихкодВBase64(Параметр.Штрихкод);
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		КлючЗаписи = НайтиПоКодуМаркировки(КодМаркировкиBase64);
		Если КлючЗаписи <> Неопределено Тогда
			ОткрытьФорму("РегистрСведений.ОперацииПроверкиКМ.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписи));
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьФискализированныеПриИзменении(Элемент)
	
	Список.Отбор.Элементы[0].Использование = ПоказыватьТолькоФискализированные;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	МенеджерОборудованияМаркировка.ПриПолученииДанныхСпискаОперацийПроверкиКМ(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция НайтиПоКодуМаркировки(КодМаркировки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииПроверкиКМ.ИдентификаторСессии КАК ИдентификаторСессии,
		|	ОперацииПроверкиКМ.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
		|	ОперацииПроверкиКМ.ИдентификаторФискальнойОперации КАК ИдентификаторФискальнойОперации,
		|	ОперацииПроверкиКМ.ГодМесяц КАК ГодМесяц,
		|	ОперацииПроверкиКМ.КодМаркировки КАК КодМаркировки
		|ИЗ
		|	РегистрСведений.ОперацииПроверкиКМ КАК ОперацииПроверкиКМ
		|ГДЕ
		|	ОперацииПроверкиКМ.КодМаркировки = &КодМаркировки";
	
	Запрос.УстановитьПараметр("КодМаркировки", КодМаркировки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ОтборПоКодуМаркировки = Новый Структура();
	ОтборПоКодуМаркировки.Вставить("ИдентификаторСессии", Выборка.ИдентификаторСессии);
	ОтборПоКодуМаркировки.Вставить("ИдентификаторЗапроса", Выборка.ИдентификаторЗапроса);
	ОтборПоКодуМаркировки.Вставить("ИдентификаторФискальнойОперации", Выборка.ИдентификаторФискальнойОперации);
	ОтборПоКодуМаркировки.Вставить("ГодМесяц", Выборка.ГодМесяц);
	ОтборПоКодуМаркировки.Вставить("КодМаркировки", Выборка.КодМаркировки);
	
	Возврат РегистрыСведений.ОперацииПроверкиКМ.СоздатьКлючЗаписи(ОтборПоКодуМаркировки);
КонецФункции

#КонецОбласти
